In [1]:
people={'first':['Corey','Jhon','Jon'],
         'last':['Schafer','Deo','Deo'],
         'email':['corey@mail.com','jhon@mail.com','jon@mail.com']}

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame(people)

In [4]:
df

   first     last           email
0  Corey  Schafer  corey@mail.com
1   Jhon      Deo   jhon@mail.com
2    Jon      Deo    jon@mail.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [7]:
df.columns=['first_name','last_name','email']

In [8]:
df

  first_name last_name           email
0      Corey   Schafer  corey@mail.com
1       Jhon       Deo   jhon@mail.com
2        Jon       Deo    jon@mail.com

In [18]:
df.columns = [x.upper() for x in df.columns]

AttributeError: 'builtin_function_or_method' object has no attribute 'upper'

In [20]:
df

,<built-in method upper of str object at 0x000002D508D386B0>,<built-in method upper of str object at 0x000002D507A047F0>,<built-in method upper of str object at 0x000002D507E008F0>
0,Corey,Schafer,corey@mail.com
1,Jhon,Deo,jhon@mail.com
2,Jon,Deo,jon@mail.com

In [22]:
df.columns =df.columns.str.upper()

In [23]:
df

     NaN      NaN             NaN
0  Corey  Schafer  corey@mail.com
1   Jhon      Deo   jhon@mail.com
2    Jon      Deo    jon@mail.com

In [24]:
df.columns=['first_name','last_name','email']

In [25]:
df

  first_name last_name           email
0      Corey   Schafer  corey@mail.com
1       Jhon       Deo   jhon@mail.com
2        Jon       Deo    jon@mail.com

In [26]:
df.columns = df.columns.str.upper()

In [27]:
df

  FIRST_NAME LAST_NAME           EMAIL
0      Corey   Schafer  corey@mail.com
1       Jhon       Deo   jhon@mail.com
2        Jon       Deo    jon@mail.com

In [28]:
df.columns = df.columns.str.replace('_',' ')

In [29]:
df

  FIRST NAME LAST NAME           EMAIL
0      Corey   Schafer  corey@mail.com
1       Jhon       Deo   jhon@mail.com
2        Jon       Deo    jon@mail.com

In [30]:
df.columns = df.columns.str.replace(' ','_')

In [31]:
df

  FIRST_NAME LAST_NAME           EMAIL
0      Corey   Schafer  corey@mail.com
1       Jhon       Deo   jhon@mail.com
2        Jon       Deo    jon@mail.com

In [32]:
df.columns = df.columns.str.lower()

In [33]:
df

  first_name last_name           email
0      Corey   Schafer  corey@mail.com
1       Jhon       Deo   jhon@mail.com
2        Jon       Deo    jon@mail.com

In [35]:
df.rename(columns={'first_name':'first', 'last_name':'last'}, inplace=True)

In [36]:
df

   first     last           email
0  Corey  Schafer  corey@mail.com
1   Jhon      Deo   jhon@mail.com
2    Jon      Deo    jon@mail.com

In [38]:
df.loc[2,['first', 'last']]= ['Peter','smith']

In [39]:
df

   first     last           email
0  Corey  Schafer  corey@mail.com
1   Jhon      Deo   jhon@mail.com
2  Peter    smith    jon@mail.com

In [40]:
df.loc[2,'first']='jhon'

In [41]:
df

   first     last           email
0  Corey  Schafer  corey@mail.com
1   Jhon      Deo   jhon@mail.com
2   jhon    smith    jon@mail.com

In [42]:
df.at[2,'last']='Deo'

In [43]:
df

   first     last           email
0  Corey  Schafer  corey@mail.com
1   Jhon      Deo   jhon@mail.com
2   jhon      Deo    jon@mail.com

In [50]:
filt=(df['email']=='jhon@mail.com')
df.loc[filt,'last']='Smith'

In [51]:
df

   first     last           email
0  Corey  Schafer  corey@mail.com
1   Jhon    Smith   jhon@mail.com
2   jhon      Deo    jon@mail.com

In [52]:
df['email'].str.lower()

0    corey@mail.com
1     jhon@mail.com
2      jon@mail.com
Name: email, dtype: object

In [53]:
df['email']=df['email'].str.upper()

In [54]:
df

   first     last           email
0  Corey  Schafer  COREY@MAIL.COM
1   Jhon    Smith   JHON@MAIL.COM
2   jhon      Deo    JON@MAIL.COM

In [55]:
df['email'].apply(len)

0    14
1    13
2    12
Name: email, dtype: int64

In [58]:
def update_email(email):
    return email.upper()

In [59]:
df['email'].apply(update_email)

0    COREY@MAIL.COM
1     JHON@MAIL.COM
2      JON@MAIL.COM
Name: email, dtype: object

In [60]:
df['email']=df['email'].apply(lambda x:x.lower())

In [61]:
df

   first     last           email
0  Corey  Schafer  corey@mail.com
1   Jhon    Smith   jhon@mail.com
2   jhon      Deo    jon@mail.com

In [62]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [63]:
len(df['email'])

3

In [65]:
df.apply(len, axis=1)

0    3
1    3
2    3
dtype: int64

In [66]:
df.apply(pd.Series.min)

first             Corey
last                Deo
email    corey@mail.com
dtype: object

In [67]:
df.apply(lambda x: x.min())

first             Corey
last                Deo
email    corey@mail.com
dtype: object

In [68]:
df.applymap(len)

   first  last  email
0      5     7     14
1      4     5     13
2      4     3     12

In [69]:
df.applymap(str.lower)

   first     last           email
0  corey  schafer  corey@mail.com
1   jhon    smith   jhon@mail.com
2   jhon      deo    jon@mail.com